; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-3-4-15)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	p0-5 - location
	p1-0 - location
	p2-3 - location
	p2-4 - location
	p2-6 - location
	p3-7 - location
	p4-1 - location
	p4-5 - location
	p4-6 - location
	p4-7 - location
	p5-2 - location
	p6-3 - location
	p6-7 - location
	p7-0 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s4)
	(at driver3 s7)
	(at truck1 s6)
	(empty truck1)
	(at truck2 s6)
	(empty truck2)
	(at truck3 s1)
	(empty truck3)
	(at truck4 s6)
	(empty truck4)
	(at package1 s4)
	(at package2 s7)
	(at package3 s1)
	(at package4 s0)
	(at package5 s1)
	(at package6 s4)
	(at package7 s4)
	(at package8 s2)
	(at package9 s6)
	(at package10 s3)
	(at package11 s4)
	(at package12 s1)
	(at package13 s5)
	(at package14 s7)
	(at package15 s1)
	(path s0 p0-5)
	(path p0-5 s0)
	(path s5 p0-5)
	(path p0-5 s5)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(path s2 p2-6)
	(path p2-6 s2)
	(path s6 p2-6)
	(path p2-6 s6)
	(path s3 p3-7)
	(path p3-7 s3)
	(path s7 p3-7)
	(path p3-7 s7)
	(path s4 p4-1)
	(path p4-1 s4)
	(path s1 p4-1)
	(path p4-1 s1)
	(path s4 p4-5)
	(path p4-5 s4)
	(path s5 p4-5)
	(path p4-5 s5)
	(path s4 p4-6)
	(path p4-6 s4)
	(path s6 p4-6)
	(path p4-6 s6)
	(path s4 p4-7)
	(path p4-7 s4)
	(path s7 p4-7)
	(path p4-7 s7)
	(path s5 p5-2)
	(path p5-2 s5)
	(path s2 p5-2)
	(path p5-2 s2)
	(path s6 p6-3)
	(path p6-3 s6)
	(path s3 p6-3)
	(path p6-3 s3)
	(path s6 p6-7)
	(path p6-7 s6)
	(path s7 p6-7)
	(path p6-7 s7)
	(path s7 p7-0)
	(path p7-0 s7)
	(path s0 p7-0)
	(path p7-0 s0)
	(link s1 s0)
	(link s0 s1)
	(link s1 s2)
	(link s2 s1)
	(link s1 s5)
	(link s5 s1)
	(link s2 s0)
	(link s0 s2)
	(link s2 s7)
	(link s7 s2)
	(link s3 s1)
	(link s1 s3)
	(link s3 s2)
	(link s2 s3)
	(link s3 s4)
	(link s4 s3)
	(link s4 s1)
	(link s1 s4)
	(link s4 s2)
	(link s2 s4)
	(link s4 s6)
	(link s6 s4)
	(link s4 s7)
	(link s7 s4)
	(link s5 s0)
	(link s0 s5)
	(link s5 s3)
	(link s3 s5)
	(link s6 s3)
	(link s3 s6)
	(link s6 s7)
	(link s7 s6)
	(link s7 s1)
	(link s1 s7)
	(link s7 s5)
	(link s5 s7)
)
	(:goal (and
	(at driver2 s1)
	(at truck1 s7)
	(at truck2 s2)
	(at truck3 s4)
	(at package1 s6)
	(at package2 s5)
	(at package3 s4)
	(at package4 s7)
	(at package5 s3)
	(at package6 s2)
	(at package7 s1)
	(at package8 s7)
	(at package9 s1)
	(at package10 s0)
	(at package11 s5)
	(at package12 s4)
	(at package13 s5)
	(at package14 s5)
	(at package15 s7)
	))


)

; plan
1. (load-truck s6 package9 truck4)
   deleted: (at package9 s6)
   added: (in package9 truck4)
   goals met: 1 of 19
2. (load-truck s1 package5 truck3)
   deleted: (at package5 s1)
   added: (in package5 truck3)
   goals met: 1 of 19
3. (load-truck s1 package3 truck3)
   deleted: (at package3 s1)
   added: (in package3 truck3)
   goals met: 1 of 19
4. (load-truck s1 package15 truck3)
   deleted: (at package15 s1)
   added: (in package15 truck3)
   goals met: 1 of 19
5. (load-truck s1 package12 truck3)
   deleted: (at package12 s1)
   added: (in package12 truck3)
   goals met: 1 of 19
6. (walk driver2 s4 p4-1)
   deleted: (at driver2 s4)
   added: (at driver2 p4-1)
   goals met: 1 of 19
7. (walk driver3 s7 p6-7)
   deleted: (at driver3 s7)
   added: (at driver3 p6-7)
   goals met: 1 of 19
8. (walk driver3 p6-7 s6)
   deleted: (at driver3 p6-7)
   added: (at driver3 s6)
   goals met: 1 of 19
9. (board-truck driver3 s6 truck4)
   deleted: (at driver3 s6) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 1 of 19
10. (drive-truck driver3 s6 s4 truck4)
   deleted: (at truck4 s6)
   added: (at truck4 s4)
   goals met: 1 of 19
11. (walk driver1 s2 p2-6)
   deleted: (at driver1 s2)
   added: (at driver1 p2-6)
   goals met: 1 of 19
12. (walk driver1 p2-6 s6)
   deleted: (at driver1 p2-6)
   added: (at driver1 s6)
   goals met: 1 of 19
13. (load-truck s4 package7 truck4)
   deleted: (at package7 s4)
   added: (in package7 truck4)
   goals met: 1 of 19
14. (load-truck s4 package6 truck4)
   deleted: (at package6 s4)
   added: (in package6 truck4)
   goals met: 1 of 19
15. (drive-truck driver3 s4 s1 truck4)
   deleted: (at truck4 s4)
   added: (at truck4 s1)
   goals met: 1 of 19
16. (unload-truck s1 package9 truck4)
   deleted: (in package9 truck4)
   added: (at package9 s1)
   goals met: 2 of 19
17. (drive-truck driver3 s1 s2 truck4)
   deleted: (at truck4 s1)
   added: (at truck4 s2)
   goals met: 2 of 19
18. (load-truck s2 package8 truck4)
   deleted: (at package8 s2)
   added: (in package8 truck4)
   goals met: 2 of 19
19. (unload-truck s2 package6 truck4)
   deleted: (in package6 truck4)
   added: (at package6 s2)
   goals met: 3 of 19
20. (drive-truck driver3 s2 s1 truck4)
   deleted: (at truck4 s2)
   added: (at truck4 s1)
   goals met: 3 of 19
21. (unload-truck s1 package7 truck4)
   deleted: (in package7 truck4)
   added: (at package7 s1)
   goals met: 4 of 19
22. (drive-truck driver3 s1 s4 truck4)
   deleted: (at truck4 s1)
   added: (at truck4 s4)
   goals met: 4 of 19
23. (load-truck s4 package11 truck4)
   deleted: (at package11 s4)
   added: (in package11 truck4)
   goals met: 4 of 19
24. (drive-truck driver3 s4 s7 truck4)
   deleted: (at truck4 s4)
   added: (at truck4 s7)
   goals met: 4 of 19
25. (board-truck driver1 s6 truck1)
   deleted: (at driver1 s6) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 4 of 19
26. (unload-truck s7 package8 truck4)
   deleted: (in package8 truck4)
   added: (at package8 s7)
   goals met: 5 of 19
27. (load-truck s7 package2 truck4)
   deleted: (at package2 s7)
   added: (in package2 truck4)
   goals met: 5 of 19
28. (drive-truck driver3 s7 s5 truck4)
   deleted: (at truck4 s7)
   added: (at truck4 s5)
   goals met: 5 of 19
29. (drive-truck driver1 s6 s7 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s7)
   goals met: 6 of 19
30. (unload-truck s5 package2 truck4)
   deleted: (in package2 truck4)
   added: (at package2 s5)
   goals met: 7 of 19
31. (unload-truck s5 package11 truck4)
   deleted: (in package11 truck4)
   added: (at package11 s5)
   goals met: 8 of 19
32. (load-truck s7 package14 truck1)
   deleted: (at package14 s7)
   added: (in package14 truck1)
   goals met: 8 of 19
33. (walk driver2 p4-1 s1)
   deleted: (at driver2 p4-1)
   added: (at driver2 s1)
   goals met: 9 of 19
34. (board-truck driver2 s1 truck3)
   deleted: (at driver2 s1) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 8 of 19
35. (drive-truck driver3 s5 s0 truck4)
   deleted: (at truck4 s5)
   added: (at truck4 s0)
   goals met: 8 of 19
36. (load-truck s0 package4 truck4)
   deleted: (at package4 s0)
   added: (in package4 truck4)
   goals met: 8 of 19
37. (drive-truck driver3 s0 s5 truck4)
   deleted: (at truck4 s0)
   added: (at truck4 s5)
   goals met: 8 of 19
38. (drive-truck driver3 s5 s7 truck4)
   deleted: (at truck4 s5)
   added: (at truck4 s7)
   goals met: 8 of 19
39. (unload-truck s7 package4 truck4)
   deleted: (in package4 truck4)
   added: (at package4 s7)
   goals met: 9 of 19
40. (drive-truck driver2 s1 s4 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s4)
   goals met: 10 of 19
41. (unload-truck s4 package3 truck3)
   deleted: (in package3 truck3)
   added: (at package3 s4)
   goals met: 11 of 19
42. (unload-truck s4 package12 truck3)
   deleted: (in package12 truck3)
   added: (at package12 s4)
   goals met: 12 of 19
43. (load-truck s4 package1 truck3)
   deleted: (at package1 s4)
   added: (in package1 truck3)
   goals met: 12 of 19
44. (drive-truck driver1 s7 s5 truck1)
   deleted: (at truck1 s7)
   added: (at truck1 s5)
   goals met: 11 of 19
45. (drive-truck driver3 s7 s6 truck4)
   deleted: (at truck4 s7)
   added: (at truck4 s6)
   goals met: 11 of 19
46. (unload-truck s5 package14 truck1)
   deleted: (in package14 truck1)
   added: (at package14 s5)
   goals met: 12 of 19
47. (drive-truck driver1 s5 s7 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s7)
   goals met: 13 of 19
48. (drive-truck driver2 s4 s3 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s3)
   goals met: 12 of 19
49. (unload-truck s3 package5 truck3)
   deleted: (in package5 truck3)
   added: (at package5 s3)
   goals met: 13 of 19
50. (drive-truck driver2 s3 s4 truck3)
   deleted: (at truck3 s3)
   added: (at truck3 s4)
   goals met: 14 of 19
51. (drive-truck driver2 s4 s7 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s7)
   goals met: 13 of 19
52. (unload-truck s7 package15 truck3)
   deleted: (in package15 truck3)
   added: (at package15 s7)
   goals met: 14 of 19
53. (drive-truck driver3 s6 s3 truck4)
   deleted: (at truck4 s6)
   added: (at truck4 s3)
   goals met: 14 of 19
54. (load-truck s3 package10 truck4)
   deleted: (at package10 s3)
   added: (in package10 truck4)
   goals met: 14 of 19
55. (drive-truck driver3 s3 s5 truck4)
   deleted: (at truck4 s3)
   added: (at truck4 s5)
   goals met: 14 of 19
56. (drive-truck driver2 s7 s4 truck3)
   deleted: (at truck3 s7)
   added: (at truck3 s4)
   goals met: 15 of 19
57. (drive-truck driver2 s4 s6 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s6)
   goals met: 14 of 19
58. (unload-truck s6 package1 truck3)
   deleted: (in package1 truck3)
   added: (at package1 s6)
   goals met: 15 of 19
59. (disembark-truck driver2 s6 truck3)
   deleted: (driving driver2 truck3)
   added: (at driver2 s6) (empty truck3)
   goals met: 15 of 19
60. (walk driver2 s6 p4-6)
   deleted: (at driver2 s6)
   added: (at driver2 p4-6)
   goals met: 15 of 19
61. (walk driver2 p4-6 s4)
   deleted: (at driver2 p4-6)
   added: (at driver2 s4)
   goals met: 15 of 19
62. (drive-truck driver1 s7 s6 truck1)
   deleted: (at truck1 s7)
   added: (at truck1 s6)
   goals met: 14 of 19
63. (disembark-truck driver1 s6 truck1)
   deleted: (driving driver1 truck1)
   added: (at driver1 s6) (empty truck1)
   goals met: 14 of 19
64. (walk driver2 s4 p4-1)
   deleted: (at driver2 s4)
   added: (at driver2 p4-1)
   goals met: 14 of 19
65. (walk driver2 p4-1 s1)
   deleted: (at driver2 p4-1)
   added: (at driver2 s1)
   goals met: 15 of 19
66. (board-truck driver1 s6 truck2)
   deleted: (at driver1 s6) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 15 of 19
67. (drive-truck driver1 s6 s7 truck2)
   deleted: (at truck2 s6)
   added: (at truck2 s7)
   goals met: 15 of 19
68. (drive-truck driver1 s7 s2 truck2)
   deleted: (at truck2 s7)
   added: (at truck2 s2)
   goals met: 16 of 19
69. (drive-truck driver3 s5 s7 truck4)
   deleted: (at truck4 s5)
   added: (at truck4 s7)
   goals met: 16 of 19
70. (drive-truck driver3 s7 s6 truck4)
   deleted: (at truck4 s7)
   added: (at truck4 s6)
   goals met: 16 of 19
71. (disembark-truck driver3 s6 truck4)
   deleted: (driving driver3 truck4)
   added: (at driver3 s6) (empty truck4)
   goals met: 16 of 19
72. (board-truck driver3 s6 truck1)
   deleted: (at driver3 s6) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 16 of 19
73. (unload-truck s6 package10 truck4)
   deleted: (in package10 truck4)
   added: (at package10 s6)
   goals met: 16 of 19
74. (load-truck s6 package10 truck1)
   deleted: (at package10 s6)
   added: (in package10 truck1)
   goals met: 16 of 19
75. (drive-truck driver3 s6 s7 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s7)
   goals met: 17 of 19
76. (drive-truck driver3 s7 s5 truck1)
   deleted: (at truck1 s7)
   added: (at truck1 s5)
   goals met: 16 of 19
77. (disembark-truck driver1 s2 truck2)
   deleted: (driving driver1 truck2)
   added: (at driver1 s2) (empty truck2)
   goals met: 16 of 19
78. (walk driver1 s2 p2-6)
   deleted: (at driver1 s2)
   added: (at driver1 p2-6)
   goals met: 16 of 19
79. (walk driver1 p2-6 s6)
   deleted: (at driver1 p2-6)
   added: (at driver1 s6)
   goals met: 16 of 19
80. (board-truck driver1 s6 truck3)
   deleted: (at driver1 s6) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 16 of 19
81. (drive-truck driver1 s6 s4 truck3)
   deleted: (at truck3 s6)
   added: (at truck3 s4)
   goals met: 17 of 19
82. (drive-truck driver3 s5 s0 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s0)
   goals met: 17 of 19
83. (unload-truck s0 package10 truck1)
   deleted: (in package10 truck1)
   added: (at package10 s0)
   goals met: 18 of 19
84. (drive-truck driver3 s0 s5 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s5)
   goals met: 18 of 19
85. (drive-truck driver3 s5 s7 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s7)
   goals met: 19 of 19
